# CSV importing

In [1]:
import pandas as pd
import numpy as np

df = pd.read_csv('data/dirty_data.csv')
df

,id,host_id,host_name,neighbourhood_group,neighbourhood,room_type,price,minimum_nights,number_of_reviews,last_review,reviews_per_month,calculated_host_listings_count,availability_365,rating
0,*2539,2787,John,Brooklynn,Kensington,Privaate room,149,1,9,43392.0,0.21,6,365,0.571896
1,2595,2845,Jennifer,Manhattan,Midtown,Entire home/apt,225,1,45,43606.0,0.38,2,355,0.184032
2,3647,4632,Elisabeth,Manhattan,Harlem,Privaate room,150,3,0,NaN,NaN,1,365,0.027267
3,3831,4869,LisaRoxanne,Brooklynn,Clinton Hill,Entire home/apt,89,1,270,43651.0,4.64,1,194,0.461664
4,5022,7192,Laura,Manhattan,East Harlem,Entire home/apt,80,10,9,43423.0,0.10,1,0,0.823074
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1203,512775,2396295,Richard,Queens,Long Island City,Entire home/apt,350,2,182,43627.0,2.20,1,272,0.424881
1204,513343,2528671,Dennis,Brooklynn,Prospect Heights,Entire home/apt,125,30,1,41101.0,0.01,1,341,0.046641
1205,513688,2530670,Tiffany,Brooklynn,Boerum Hill,Entire home/apt,350,2,134,43653.0,1.56,1,56,0.206727
1206,514457,2096690,Richard,Brooklynn,Bedford-Stuyvesant,Entire home/apt,150,10,10,43611.0,0.17,2,185,0.482942
1207,514548,2533991,Amanda,Brooklynn,Bushwick,Entire home/apt,180,30,0,NaN,NaN,1,352,0.701032

# CSV cleaning for:
### 1. stray characters

In [2]:
df.neighbourhood.unique()
#found an * character & spaces in '* South Slope '
#found Capitalization errors in 'upper West Side', 'DUMBO'

array(['Kensington', 'Midtown', 'Harlem', 'Clinton Hill', 'East Harlem',
       'Murray Hill', 'Bedford-Stuyvesant', "Hell's Kitchen",
       'upper West Side', 'Chinatown', 'South Slope', 'West Village',
       'Williamsburg', 'Fort Greene', 'Chelsea', 'Crown Heights',
       'Park Slope', 'Windsor Terrace', 'Inwood', 'East Village',
       'Greenpoint', 'Bushwick', 'Flatbush', 'Lower East Side',
       'Prospect-Lefferts Gardens', 'Long Island City', 'Kips Bay',
       'SoHo', 'Upper East Side', 'Prospect Heights',
       'Washington Heights', 'Woodside', 'Brooklynn Heights',
       'Carroll Gardens', 'Gowanus', '* South Slope ', 'Flatlands',
       'Cobble Hill', 'Flushing', 'Boerum Hill', 'Sunnyside', 'DUMBO',
       'St. George', 'Highbridge', 'Financial District', 'Ridgewood',
       'Morningside Heights', 'Jamaica', 'Middle Village', 'NoHo',
       'Ditmars Steinway', 'Flatiron District', 'Roosevelt Island',
       'Greenwich Village', 'Little Italy', 'East Flatbush',
       'Tompkinsville', 'Astoria', 'Clason Point', 'Eastchester',
       'Kingsbridge', 'Two Bridges', 'Queens Village', 'Rockaway Beach',
       'Forest Hills', 'Nolita', 'Woodlawn', 'University Heights',
       'Gravesend', 'Gramercy', 'Allerton', 'East New York',
       'Theater District', 'Concourse Village', 'Sheepshead Bay',
       'Emerson Hill', 'Fort Hamilton', 'Bensonhurst', 'Tribeca',
       'Shore Acres', 'Sunset Park', 'Concourse', 'Elmhurst',
       'Brighton Beach', 'Jackson Heights', 'Cypress Hills', 'St. Albans',
       'Arrochar', 'Rego Park', 'Wakefield', 'Clifton', 'Bay Ridge',
       'Graniteville', 'Spuyten Duyvil', 'Stapleton', 'Briarwood',
       'Ozone Park', 'Columbia St', 'Vinegar Hill', 'Mott Haven',
       'Longwood', 'Canarsie', 'Battery Park City', 'Civic Center',
       'East Elmhurst', 'New Springville', 'Morris Heights'], dtype=object)

In [3]:
df.neighbourhood = df.neighbourhood.replace('upper West Side', 'Upper West Side', regex=True)
df.neighbourhood = df.neighbourhood.replace('DUMBO', 'Dumbo', regex=True)
df.neighbourhood = df.neighbourhood.replace('\* South Slope ', 'South Slope', regex=True)
df.neighbourhood.unique()

array(['Kensington', 'Midtown', 'Harlem', 'Clinton Hill', 'East Harlem',
       'Murray Hill', 'Bedford-Stuyvesant', "Hell's Kitchen",
       'Upper West Side', 'Chinatown', 'South Slope', 'West Village',
       'Williamsburg', 'Fort Greene', 'Chelsea', 'Crown Heights',
       'Park Slope', 'Windsor Terrace', 'Inwood', 'East Village',
       'Greenpoint', 'Bushwick', 'Flatbush', 'Lower East Side',
       'Prospect-Lefferts Gardens', 'Long Island City', 'Kips Bay',
       'SoHo', 'Upper East Side', 'Prospect Heights',
       'Washington Heights', 'Woodside', 'Brooklynn Heights',
       'Carroll Gardens', 'Gowanus', 'Flatlands', 'Cobble Hill',
       'Flushing', 'Boerum Hill', 'Sunnyside', 'Dumbo', 'St. George',
       'Highbridge', 'Financial District', 'Ridgewood',
       'Morningside Heights', 'Jamaica', 'Middle Village', 'NoHo',
       'Ditmars Steinway', 'Flatiron District', 'Roosevelt Island',
       'Greenwich Village', 'Little Italy', 'East Flatbush',
       'Tompkinsville', 'Astoria', 'Clason Point', 'Eastchester',
       'Kingsbridge', 'Two Bridges', 'Queens Village', 'Rockaway Beach',
       'Forest Hills', 'Nolita', 'Woodlawn', 'University Heights',
       'Gravesend', 'Gramercy', 'Allerton', 'East New York',
       'Theater District', 'Concourse Village', 'Sheepshead Bay',
       'Emerson Hill', 'Fort Hamilton', 'Bensonhurst', 'Tribeca',
       'Shore Acres', 'Sunset Park', 'Concourse', 'Elmhurst',
       'Brighton Beach', 'Jackson Heights', 'Cypress Hills', 'St. Albans',
       'Arrochar', 'Rego Park', 'Wakefield', 'Clifton', 'Bay Ridge',
       'Graniteville', 'Spuyten Duyvil', 'Stapleton', 'Briarwood',
       'Ozone Park', 'Columbia St', 'Vinegar Hill', 'Mott Haven',
       'Longwood', 'Canarsie', 'Battery Park City', 'Civic Center',
       'East Elmhurst', 'New Springville', 'Morris Heights'], dtype=object)

### 2. misspelled words

In [4]:
df.neighbourhood_group.unique()
#typo in 'Brooklynn'
df = df.replace('Brooklynn','Brooklyn', regex=True)
df.neighbourhood_group.unique()

array(['Brooklyn', 'Manhattan', 'Queens', 'Staten Island', 'Bronx'],
      dtype=object)

In [5]:
df.room_type.unique()
#found misspelled 'Privaate room'
df.room_type = df.room_type.replace('Privaate room', 'Private Room', regex=True)
df.room_type.unique()

array(['Private Room', 'Entire home/apt', 'Shared room'], dtype=object)

### 3. duplicate data

In [6]:
df.duplicated().sum()
#no dupes

0

### 4. datatypes

In [7]:
df.info()
#all good here

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1208 entries, 0 to 1207
Data columns (total 14 columns):
 #   Column                          Non-Null Count  Dtype
---  ------                          --------------  -----
 0   id                              1208 non-null   object
 1   host_id                         1208 non-null   int64
 2   host_name                       1207 non-null   object
 3   neighbourhood_group             1208 non-null   object
 4   neighbourhood                   1208 non-null   object
 5   room_type                       1208 non-null   object
 6   price                           1208 non-null   int64
 7   minimum_nights                  1208 non-null   int64
 8   number_of_reviews               1208 non-null   int64
 9   last_review                     1158 non-null   float64
 10  reviews_per_month               1158 non-null   float64
 11  calculated_host_listings_count  1208 non-null   int64
 12  availability_365                1208 non-null   int64
 13  rating                          1208 non-null   float64
dtypes: float64(3), int64(6), object(5)
memory usage: 132.2+ KB

### 5. null values

In [8]:
# can we fill missing host_name with placeholder?
# should we drop the 50 missing reviews per onth, since we do care about that metric? 0 may skew data?
# the listings with null values related to reviewing are due to zero reviews total, 
### so we can safely add 0 to those values

df.fillna(0)
df.isnull().sum()
# WHY DIDNT THIS WORK?

id                                 0
host_id                            0
host_name                          1
neighbourhood_group                0
neighbourhood                      0
room_type                          0
price                              0
minimum_nights                     0
number_of_reviews                  0
last_review                       50
reviews_per_month                 50
calculated_host_listings_count     0
availability_365                   0
rating                             0
dtype: int64

In [9]:
df["last_review"] = df["last_review"].fillna(value=0)
df.isnull().sum()

id                                 0
host_id                            0
host_name                          1
neighbourhood_group                0
neighbourhood                      0
room_type                          0
price                              0
minimum_nights                     0
number_of_reviews                  0
last_review                        0
reviews_per_month                 50
calculated_host_listings_count     0
availability_365                   0
rating                             0
dtype: int64

In [10]:
df["reviews_per_month"] = df["reviews_per_month"].fillna(value=0)
df.isnull().sum()

id                                0
host_id                           0
host_name                         1
neighbourhood_group               0
neighbourhood                     0
room_type                         0
price                             0
minimum_nights                    0
number_of_reviews                 0
last_review                       0
reviews_per_month                 0
calculated_host_listings_count    0
availability_365                  0
rating                            0
dtype: int64

Chrissy
    
● How are the numeric values distributed (i.e. descriptive statistics)?

In [11]:
df.describe()

,host_id,price,minimum_nights,number_of_reviews,last_review,reviews_per_month,calculated_host_listings_count,availability_365,rating
count,1.208000e+03,1208.000000,1208.000000,1208.000000,1208.000000,1208.000000,1208.000000,1208.000000,1208.000000
mean,9.474827e+05,159.344371,9.150662,78.323675,41522.240894,0.887831,2.225166,165.152318,0.495490
std,9.116983e+05,148.716833,23.692776,88.634792,8650.631237,0.979817,4.048868,134.035522,0.285933
min,2.787000e+03,20.000000,1.000000,0.000000,0.000000,0.000000,1.000000,0.000000,0.000107
25%,2.576828e+05,85.000000,2.000000,14.000000,43218.750000,0.180000,1.000000,12.000000,0.260978
50%,7.463835e+05,129.000000,3.000000,43.000000,43603.500000,0.540000,1.000000,188.000000,0.496360
75%,1.470862e+06,195.000000,6.000000,116.000000,43639.000000,1.280000,2.000000,291.250000,0.730903
max,1.060985e+07,3000.000000,365.000000,480.000000,43654.000000,7.140000,28.000000,365.000000,0.997866

Rosana
● What’s the average room price in each borough?

In [12]:
pivot_df = pd.pivot_table(df, index='neighbourhood_group', values='price')      
pivot_df

                          price
neighbourhood_group
Bronx                 67.647059
Brooklyn             148.764912
Manhattan            181.994536
Queens                96.103448
Staten Island         75.214286

Chaya
● What neighborhood has the most expensive rentals (max of mean)?

In [13]:
pivot2_df = pd.pivot_table(df, index='neighbourhood', values='price', aggfunc=('max', 'mean'))      
pivot2_df

                    max        mean
neighbourhood
Allerton            125   80.000000
Arrochar            250  141.666667
Astoria             192  103.090909
Battery Park City    65   65.000000
Bay Ridge            49   49.000000
...                 ...         ...
West Village       1300  245.216216
Williamsburg        451  147.477612
Windsor Terrace     300  150.714286
Woodlawn             77   77.000000
Woodside             85   77.500000

[106 rows x 2 columns]

In [14]:
pivot2_df["mean"].max()
# where in the 1200 rows of data is this max value?

410.0

In [15]:
pivot2_df.sort_values('mean')
#greatest-value mean listed = max of mean = max avg price in Brooklyn Heights

                    max     mean
neighbourhood
Graniteville         20   20.000
Tompkinsville        37   36.500
University Heights   37   37.000
Canarsie             39   39.000
Highbridge           45   42.500
...                 ...      ...
Nolita              495  281.125
Dumbo               350  300.000
Tribeca             500  325.000
Civic Center        328  328.000
Brooklyn Heights    800  410.000

[106 rows x 2 columns]

Kosta
● What type of room costs the most? The least?

In [16]:
pivot3_df = pd.pivot_table(df, index='room_type', values='price', aggfunc=('mean'))
pivot3_df

                      price
room_type
Entire home/apt  196.534075
Private Room     105.379167
Shared room       66.444444

Kosta
    
● Are higher ratings correlated with higher prices?

In [17]:
df[["price","rating"]].corr()
#low value =0.013137 so R is too low to definitively say high correlation
# LOW CORR

           price    rating
price   1.000000  0.013137
rating  0.013137  1.000000

All 
    
● Are hosts with more rentals more likely to receive higher ratings?

In [18]:
df[["calculated_host_listings_count","rating"]].corr()
# LOW CORR, altho negative this time

                                calculated_host_listings_count    rating
calculated_host_listings_count                        1.000000 -0.026871
rating                                               -0.026871  1.000000

All 

● What’s the ‘best’ rental in NYC, considering location, price, and rating?  (this is a 
subjective judgment, but make sure you justify your choice)

In [19]:
# Are you a renter or a landlord? 
# "Best Place to Rent" = cheapest without bedbugs
# "Best Rental to Own" = most expensive to rent

lastq1 = df.groupby('neighbourhood_group')[['price']].max()
lastq1
#priciest spot (best rental to own)

                     price
neighbourhood_group
Bronx                  125
Brooklyn               800
Manhattan             3000
Queens                 350
Staten Island          250

In [20]:
#cheapest spot (best to rent)
lastq2 = df.groupby('neighbourhood_group')[['price']].min()
lastq2

                     price
neighbourhood_group
Bronx                   35
Brooklyn                30
Manhattan               40
Queens                  30
Staten Island           20

# Incomplete Attempts / scratchwork from hereon out

In [21]:
pivotL = pd.pivot_table(df, index='neighbourhood_group', values='price', aggfunc=('mean'))
.sort_values(['rating', 'price'], ascending=[False,True])
table1

SyntaxError: invalid syntax (3714484302.py, line 2)

In [ ]:
rentals1 = df.groupby('neighbourhood_group')[['price']].mean()
rentals1